SimedruF/ESP32-MQTT-Home-Assistant-DIY-Kit/src/main.cpp
/*
  ESP32 MQTT Home Assistant DIY Kit
  ====================================
  Tintele suportate:
  - ESP32-WROOM-32 / ESP32 Dev Module
  - ESP32-C3-DevKitM-1
  - ESP32-C6-DevKitC-1
  - ESP32-C6 Super Mini
  - ESP32-S3-DevKitC-1
  - LILYGO T-ZIGBEE v1.2 (ESP32-C3 + TLSR8258)

  Pinii pentru DHT11, PIR, releu, OLED si heartbeat sunt configurabili
  din interfata web si persistati in NVS.

  Functionalitati:
  - MQTT cu Home Assistant Auto-Discovery
  - Web dashboard in timp real
  - Display OLED cu status complet
  - Configurare WiFi prin browser (AP mode)
  - FreeRTOS tasks pentru citire senzori

*/

#include <Arduino.h>
#include <WiFi.h>
#include <ESPmDNS.h>
#include <WiFiWebManager.h>
#include <WebPages.h>
#include <HardwareConfig.h>
#include <PubSubClient.h>
#include <DHT.h>
#include <Wire.h>
#include <Adafruit_GFX.h>
#include <Adafruit_SSD1306.h>
#include <Preferences.h>
#include <esp_chip_info.h>
#include <esp_system.h>
#include <soc/soc_caps.h>
#include <SerialLog.h>

#define DHT_TYPE        DHT11

// OLED SSD1306 128x64 I2C
#define OLED_WIDTH      128
#define OLED_HEIGHT     64
#define OLED_RESET      -1
#define OLED_I2C_FREQ   400000UL

// ============================================================
//  Configuratie MQTT — stocata in NVS, editabila din pagina web
// ============================================================
String g_mqttBroker   = "192.168.1.100";
int    g_mqttPort     = 1883;
String g_mqttUser     = "";
String g_mqttPass     = "";
String g_mqttClientId = "esp32-ha-kit";

// Topice MQTT
static const char* TOPIC_STATE       = "esp32kit/state";
static const char* TOPIC_RELAY_STATE = "esp32kit/relay/state";
static const char* TOPIC_RELAY_CMD   = "esp32kit/relay/command";

// Topice Home Assistant Auto-Discovery
static const char* DISC_TEMP   = "homeassistant/sensor/esp32kit/temperature/config";
static const char* DISC_HUM    = "homeassistant/sensor/esp32kit/humidity/config";
static const char* DISC_MOTION = "homeassistant/binary_sensor/esp32kit/motion/config";
static const char* DISC_RELAY  = "homeassistant/switch/esp32kit/relay/config";

// NVS pentru setarile MQTT
Preferences mqttPrefs;
Preferences uiPrefs;
Preferences communicationPrefs;
String g_uiLanguage = "ro";
String g_selectedCommunication = "wifi_mqtt";
String g_zigbeeCoordinator = "generic";
String g_zigbeeCoordinatorHost = "";
String g_zigbeePairingMode = "auto";

bool hasNativeIeee802154()
{
#if defined(SOC_IEEE802154_SUPPORTED) && SOC_IEEE802154_SUPPORTED
  return true;
#else
  return false;
#endif
}

bool hasExternalZigbeeRadio()
{
#if defined(ZIGBEE_COPROCESSOR_TLSR8258)
  return true;
#else
  return false;
#endif
}

bool hasZigbeeCapability()
{
  return hasNativeIeee802154() || hasExternalZigbeeRadio();
}

const char* activeCommunicationMode()
{
#if defined(IOT_PROTOCOL_ACTIVE_THREAD)
  return "thread";
#elif defined(ZIGBEE_MODE_ED) || defined(ZIGBEE_MODE_ZCZR)
  return "zigbee";
#else
  return "wifi_mqtt";
#endif
}

bool isValidCommunicationMode(const String& mode)
{
  if (mode == "wifi_mqtt") return true;
  if (mode == "zigbee") return hasZigbeeCapability();
  if (mode == "thread") return hasNativeIeee802154();
  return false;
}

bool isValidZigbeeCoordinator(const String& coordinator)
{
  return coordinator == "generic" ||
         coordinator == "zha" ||
         coordinator == "zigbee2mqtt" ||
         coordinator == "zbbridge_u";
}

bool isValidZigbeePairingMode(const String& pairingMode)
{
  return pairingMode == "auto" || pairingMode == "force_new";
}

bool isValidCoordinatorHost(const String& host)
{
  if (host.length() > 96) return false;
  for (size_t i = 0; i < host.length(); ++i)
  {
    const char c = host[i];
    if (!isAlphaNumeric(c) && c != '.' && c != '-' && c != ':' &&
        c != '[' && c != ']')
      return false;
  }
  return true;
}

void loadCommunicationConfig()
{
  if (!communicationPrefs.begin("iot_radio", false))
  {
    serialLog.println("[IoT] NVS indisponibil; se foloseste MQTT prin WiFi");
    return;
  }

  const String storedMode = communicationPrefs.getString("protocol", "wifi_mqtt");
  const String storedCoordinator =
    communicationPrefs.getString("zb_coord", "generic");
  const String storedCoordinatorHost =
    communicationPrefs.getString("zb_host", "");
  const String storedPairingMode =
    communicationPrefs.getString("zb_pair", "auto");
  communicationPrefs.end();
  g_selectedCommunication = isValidCommunicationMode(storedMode)
    ? storedMode
    : "wifi_mqtt";
  g_zigbeeCoordinator = isValidZigbeeCoordinator(storedCoordinator)
    ? storedCoordinator
    : "generic";
  g_zigbeeCoordinatorHost = isValidCoordinatorHost(storedCoordinatorHost)
    ? storedCoordinatorHost
    : "";
  g_zigbeePairingMode = isValidZigbeePairingMode(storedPairingMode)
    ? storedPairingMode
    : "auto";

  serialLog.printf("[IoT] Mod selectat: %s | activ: %s | coordinator: %s%s%s | pairing: %s\n",
                   g_selectedCommunication.c_str(), activeCommunicationMode(),
                   g_zigbeeCoordinator.c_str(),
                   g_zigbeeCoordinatorHost.length() ? " @ " : "",
                   g_zigbeeCoordinatorHost.c_str(),
                   g_zigbeePairingMode.c_str());
}

bool saveCommunicationConfig(const String& mode, const String& coordinator,
                             const String& coordinatorHost,
                             const String& pairingMode)
{
  if (!isValidCommunicationMode(mode) ||
      !isValidZigbeeCoordinator(coordinator) ||
      !isValidCoordinatorHost(coordinatorHost) ||
      !isValidZigbeePairingMode(pairingMode))
    return false;

  if (!communicationPrefs.begin("iot_radio", false)) return false;
  const bool protocolSaved = communicationPrefs.putString("protocol", mode) > 0;
  const bool coordinatorSaved =
    communicationPrefs.putString("zb_coord", coordinator) > 0;
  const bool hostSaved = coordinatorHost.length() == 0
    ? communicationPrefs.remove("zb_host") || !communicationPrefs.isKey("zb_host")
    : communicationPrefs.putString("zb_host", coordinatorHost) > 0;
  const bool pairingSaved =
    communicationPrefs.putString("zb_pair", pairingMode) > 0;
  communicationPrefs.end();
  if (!protocolSaved || !coordinatorSaved || !hostSaved || !pairingSaved)
    return false;

  g_selectedCommunication = mode;
  g_zigbeeCoordinator = coordinator;
  g_zigbeeCoordinatorHost = coordinatorHost;
  g_zigbeePairingMode = pairingMode;
  return true;
}

void loadUiConfig()
{
  if (!uiPrefs.begin("ui", false))
  {
    serialLog.println("[UI] NVS indisponibil; se foloseste limba romana");
    return;
  }
  g_uiLanguage = uiPrefs.getString("language", "ro");
  if (g_uiLanguage != "ro" && g_uiLanguage != "en")
    g_uiLanguage = "ro";
  uiPrefs.end();
  serialLog.println("[UI] Limba interfetei: " + g_uiLanguage);
}

bool saveUiLanguage(const String& language)
{
  if (language != "ro" && language != "en") return false;
  if (!uiPrefs.begin("ui", false)) return false;
  const bool saved = uiPrefs.putString("language", language) > 0;
  uiPrefs.end();
  if (saved) g_uiLanguage = language;
  return saved;
}

void loadMqttConfig()
{
  // Read-write creates the namespace on first boot. Opening a missing namespace
  // read-only makes Preferences emit ESP_ERR_NVS_NOT_FOUND even though defaults work.
  if (!mqttPrefs.begin("mqtt", false))
  {
    serialLog.println("[MQTT] NVS indisponibil; se foloseste configuratia implicita");
    return;
  }
  g_mqttBroker   = mqttPrefs.getString("broker",   g_mqttBroker);
  g_mqttPort     = mqttPrefs.getInt(   "port",     g_mqttPort);
  g_mqttUser     = mqttPrefs.getString("user",     g_mqttUser);
  g_mqttPass     = mqttPrefs.getString("pass",     g_mqttPass);
  g_mqttClientId = mqttPrefs.getString("client_id",g_mqttClientId);
  mqttPrefs.end();
  serialLog.printf("[MQTT] Config NVS: %s:%d  user='%s'  client='%s'\n",
                   g_mqttBroker.c_str(), g_mqttPort,
                   g_mqttUser.c_str(), g_mqttClientId.c_str());
}

void saveMqttConfig(const String& broker, int port,
                    const String& user,   const String& pass,
                    const String& clientId)
{
  if (!mqttPrefs.begin("mqtt", false))
  {
    serialLog.println("[MQTT] Eroare la deschiderea NVS pentru scriere");
    return;
  }
  mqttPrefs.putString("broker",    broker);
  mqttPrefs.putInt(   "port",      port);
  mqttPrefs.putString("user",      user);
  mqttPrefs.putString("pass",      pass);
  mqttPrefs.putString("client_id", clientId);
  mqttPrefs.end();
  g_mqttBroker   = broker;
  g_mqttPort     = port;
  g_mqttUser     = user;
  g_mqttPass     = pass;
  g_mqttClientId = clientId;
  serialLog.println("[MQTT] Configuratie salvata in NVS");
}

