SimedruF/ESP32-MQTT-Home-Assistant-DIY-Kit/src/main.cpp
// ============================================================
//  Obiecte globale
// ============================================================
WiFiWebManager   wifiManager("ESP32_HAKit", "12345678");
DHT*             dht = nullptr;
// Aceeasi frecventa in timpul si dupa transfer evita recrearea repetata a
// handle-ului I2C in Arduino-ESP32 3.x.
Adafruit_SSD1306 oled(OLED_WIDTH, OLED_HEIGHT, &Wire, OLED_RESET,
                     OLED_I2C_FREQ, OLED_I2C_FREQ);
WiFiClient       wifiClient;
PubSubClient     mqttClient(wifiClient);
HardwareConfigStore hardwareStore;
HardwareConfig      g_hardware;

static bool g_oledReady = false;
static bool g_oledFailureReported = false;
static bool g_mdnsReady = false;
static unsigned long g_restartAt = 0;

#if defined(RGB_BUILTIN)
static constexpr bool RGB_LED_SUPPORTED = true;
#else
static constexpr bool RGB_LED_SUPPORTED = false;
#endif

static bool g_rgbLedOn = false;
static uint8_t g_rgbLedRed = 0;
static uint8_t g_rgbLedGreen = 128;
static uint8_t g_rgbLedBlue = 255;
static uint8_t g_rgbLedBrightness = 25;

// ============================================================
//  Variabile partajate (protejate de mutex intre task-uri)
// ============================================================
volatile float g_temperature    = NAN;
volatile float g_humidity       = NAN;
volatile bool  g_dhtPresent     = false;
volatile bool  g_motionDetected = false;
volatile bool  g_relayActive    = false;

// Accesat doar din loop() (core 1 - Arduino loop task)
static bool g_mqttConnected      = false;
static bool g_discoveryPublished = false;

// Mutex FreeRTOS pentru date partajate intre task-uri
// (portENTER_CRITICAL dezactiveaza intreruperile -> provoaca Interrupt WDT)
SemaphoreHandle_t g_mutex = nullptr;

// ============================================================
//  Control releu
// ============================================================
void setRelay(bool active)
{
  if (g_hardware.relayPin == PIN_DISABLED) return;

  const uint8_t activeLevel = g_hardware.relayActiveLow ? LOW : HIGH;
  digitalWrite(g_hardware.relayPin, active ? activeLevel : !activeLevel);

  xSemaphoreTake(g_mutex, portMAX_DELAY);
  g_relayActive = active;
  xSemaphoreGive(g_mutex);

  if (mqttClient.connected())
    mqttClient.publish(TOPIC_RELAY_STATE, active ? "ON" : "OFF", /*retain=*/true);
}

// ============================================================
//  Control LED RGB onboard
// ============================================================
void applyRgbLed()
{
#if defined(RGB_BUILTIN)
  if (!g_rgbLedOn)
  {
    rgbLedWrite(RGB_BUILTIN, 0, 0, 0);
    return;
  }

  const uint8_t red = static_cast<uint8_t>(
    (static_cast<uint16_t>(g_rgbLedRed) * g_rgbLedBrightness) / 100);
  const uint8_t green = static_cast<uint8_t>(
    (static_cast<uint16_t>(g_rgbLedGreen) * g_rgbLedBrightness) / 100);
  const uint8_t blue = static_cast<uint8_t>(
    (static_cast<uint16_t>(g_rgbLedBlue) * g_rgbLedBrightness) / 100);
  rgbLedWrite(RGB_BUILTIN, red, green, blue);
#endif
}

String rgbLedStateJson()
{
  String json;
  json.reserve(120);
  json = F("{\"supported\":");
  json += RGB_LED_SUPPORTED ? F("true") : F("false");
  json += F(",\"on\":");
  json += g_rgbLedOn ? F("true") : F("false");
  json += F(",\"red\":");
  json += g_rgbLedRed;
  json += F(",\"green\":");
  json += g_rgbLedGreen;
  json += F(",\"blue\":");
  json += g_rgbLedBlue;
  json += F(",\"brightness\":");
  json += g_rgbLedBrightness;
#if defined(PIN_RGB_LED)
  json += F(",\"pin\":");
  json += PIN_RGB_LED;
#else
  json += F(",\"pin\":-1");
#endif
  json += '}';
  return json;
}

// ============================================================
//  OLED helpers  (apelat doar din loop() - Wire-safe pe core 1)
// ============================================================
bool isI2cDevicePresent(uint8_t address)
{
  Wire.beginTransmission(address);
  return Wire.endTransmission(true) == 0;
}

void disableOled(const __FlashStringHelper* reason)
{
  g_oledReady = false;
  if (!g_oledFailureReported)
  {
    serialLog.print(F("[OLED] Dezactivat: "));
    serialLog.println(reason);
    g_oledFailureReported = true;
  }
}

void oledDrawStatus()
{
  if (!g_oledReady) return;
  if (!isI2cDevicePresent(g_hardware.oledAddress))
  {
    disableOled(F("display-ul nu mai raspunde pe magistrala I2C"));
    return;
  }

  float temp, hum;
  bool  motion, relay;

  xSemaphoreTake(g_mutex, portMAX_DELAY);
  temp   = g_temperature;
  hum    = g_humidity;
  motion = g_motionDetected;
  relay  = g_relayActive;
  xSemaphoreGive(g_mutex);

  oled.clearDisplay();
  oled.setTextColor(SSD1306_WHITE);
  oled.setTextSize(1);

  // Titlu
  oled.setCursor(22, 0);
  oled.print(F("ESP32 HA Kit"));
  oled.drawLine(0, 9, OLED_WIDTH - 1, 9, SSD1306_WHITE);

  // Temperatura
  oled.setCursor(0, 13);
  oled.print(F("Temp:  "));
  if (!isnan(temp)) { oled.print(temp, 1); oled.print(F(" C")); }
  else               oled.print(F("--.-"));

  // Umiditate
  oled.setCursor(0, 24);
  oled.print(F("Umid:  "));
  if (!isnan(hum)) { oled.print(hum, 1); oled.print(F(" %")); }
  else              oled.print(F("--.-"));

  // Miscare PIR
  oled.setCursor(0, 35);
  oled.print(F("Miscare: "));
  if (motion)
  {
    oled.fillRect(68, 33, 58, 11, SSD1306_WHITE);
    oled.setTextColor(SSD1306_BLACK);
    oled.setCursor(70, 35);
    oled.print(F("DETECTAT"));
    oled.setTextColor(SSD1306_WHITE);
  }
  else
  {
    oled.print(F("Nu"));
  }

  // Releu
  oled.setCursor(0, 46);
  oled.print(F("Releu:   "));
  oled.print(relay ? F("ON ") : F("OFF"));

  // Bara status
  oled.drawLine(0, 54, OLED_WIDTH - 1, 54, SSD1306_WHITE);
  oled.setCursor(0, 56);
  if (wifiManager.isConnected())
  {
    String ip = wifiManager.getIPAddress();
    int dot1  = ip.indexOf('.', ip.indexOf('.') + 1);
    oled.print(ip.substring(dot1 + 1));         // ultimii 2 octeti
    oled.print(g_mqttConnected ? F(" MQTT:OK") : F(" MQTT:--"));
  }
  else
  {
    oled.print(F("AP: ESP32_HAKit"));
  }

  oled.display();
}

