SimedruF/ESP32-MQTT-Home-Assistant-DIY-Kit/src/main.cpp
// ============================================================
//  FreeRTOS Tasks
// ============================================================
void taskSensors(void* parameter)
{
  (void)parameter;

  unsigned long lastDhtRead = 0;
  uint8_t consecutiveDhtFailures = 0;

  while (true)
  {
    unsigned long now = millis();

    // DHT11: citire la fiecare 2 secunde (max 1 citire/sec conform datasheet)
    if (dht != nullptr && now - lastDhtRead >= 2000)
    {
      lastDhtRead = now;
      float t = dht->readTemperature();
      float h = dht->readHumidity();

      if (!isnan(t) && !isnan(h))
      {
        consecutiveDhtFailures = 0;
        xSemaphoreTake(g_mutex, portMAX_DELAY);
        g_temperature = t;
        g_humidity    = h;
        g_dhtPresent  = true;
        xSemaphoreGive(g_mutex);
      }
      else if (++consecutiveDhtFailures >= 3)
      {
        xSemaphoreTake(g_mutex, portMAX_DELAY);
        g_temperature = NAN;
        g_humidity    = NAN;
        g_dhtPresent  = false;
        xSemaphoreGive(g_mutex);
      }
    }

    // PIR HC-SR501: citire continua (HIGH = miscare detectata)
    if (g_hardware.pirPin != PIN_DISABLED)
    {
      bool motion = (digitalRead(g_hardware.pirPin) == HIGH);
      xSemaphoreTake(g_mutex, portMAX_DELAY);
      g_motionDetected = motion;
      xSemaphoreGive(g_mutex);
    }

    vTaskDelay(pdMS_TO_TICKS(100));
  }
}

void taskHeartbeat(void* parameter)
{
  (void)parameter;

  bool state = false;
  while (true)
  {
    state = !state;
    digitalWrite(g_hardware.heartbeatPin, state ? HIGH : LOW);
    vTaskDelay(pdMS_TO_TICKS(500));
  }
}

// ============================================================
//  MQTT
// ============================================================
void mqttCallback(char* topic, byte* payload, unsigned int length)
{
  String msg;
  for (unsigned int i = 0; i < length; ++i)
    msg += static_cast<char>(payload[i]);

  if (String(topic) == String(TOPIC_RELAY_CMD))
  {
    if      (msg == "ON")  setRelay(true);
    else if (msg == "OFF") setRelay(false);
  }
}

void publishDiscovery()
{
  // Bloc device comun (inclus in fiecare config)
  const String dev =
    "\"device\":{"
    "\"identifiers\":[\"esp32kit\"],"
    "\"name\":\"ESP32 HA Kit\","
    "\"model\":\"" + String(ESP.getChipModel()) + "\","
    "\"manufacturer\":\"Espressif Systems\","
    "\"sw_version\":\"1.0.0\""
    "}";

  // Temperatura si umiditate
  if (g_hardware.dhtPin != PIN_DISABLED)
  {
    String cfg = "{\"name\":\"Temperatura\","
                 "\"device_class\":\"temperature\","
                 "\"unit_of_measurement\":\"\xC2\xB0" "C\","
                 "\"state_topic\":\"" + String(TOPIC_STATE) + "\","
                 "\"value_template\":\"{{ value_json.temperature | round(1) }}\","
                 "\"unique_id\":\"esp32kit_temperature\","
                 + dev + "}";
    mqttClient.publish(DISC_TEMP, cfg.c_str(), true);

    cfg = "{\"name\":\"Umiditate\","
          "\"device_class\":\"humidity\","
          "\"unit_of_measurement\":\"%\","
          "\"state_topic\":\"" + String(TOPIC_STATE) + "\","
          "\"value_template\":\"{{ value_json.humidity | round(1) }}\","
          "\"unique_id\":\"esp32kit_humidity\","
          + dev + "}";
    mqttClient.publish(DISC_HUM, cfg.c_str(), true);
  }
  else
  {
    mqttClient.publish(DISC_TEMP, "", true);
    mqttClient.publish(DISC_HUM, "", true);
  }

  // Senzor PIR miscare
  if (g_hardware.pirPin != PIN_DISABLED)
  {
    String cfg = "{\"name\":\"Miscare\","
                 "\"device_class\":\"motion\","
                 "\"state_topic\":\"" + String(TOPIC_STATE) + "\","
                 "\"value_template\":\"{{ value_json.motion }}\","
                 "\"payload_on\":\"true\","
                 "\"payload_off\":\"false\","
                 "\"unique_id\":\"esp32kit_motion\","
                 + dev + "}";
    mqttClient.publish(DISC_MOTION, cfg.c_str(), true);
  }
  else
  {
    mqttClient.publish(DISC_MOTION, "", true);
  }

  // Releu switch
  if (g_hardware.relayPin != PIN_DISABLED)
  {
    String cfg = "{\"name\":\"Releu\","
                 "\"state_topic\":\"" + String(TOPIC_RELAY_STATE) + "\","
                 "\"command_topic\":\"" + String(TOPIC_RELAY_CMD) + "\","
                 "\"payload_on\":\"ON\","
                 "\"payload_off\":\"OFF\","
                 "\"unique_id\":\"esp32kit_relay\","
                 + dev + "}";
    mqttClient.publish(DISC_RELAY, cfg.c_str(), true);
  }
  else
  {
    mqttClient.publish(DISC_RELAY, "", true);
  }

  g_discoveryPublished = true;
  serialLog.println("[MQTT] Home Assistant discovery publicat");
}

bool mqttReconnect()
{
  mqttClient.setServer(g_mqttBroker.c_str(), g_mqttPort);
  serialLog.printf("[MQTT] Conectare la %s:%d ...\n", g_mqttBroker.c_str(), g_mqttPort);

  bool ok = (g_mqttUser.length() > 0)
    ? mqttClient.connect(g_mqttClientId.c_str(), g_mqttUser.c_str(), g_mqttPass.c_str())
    : mqttClient.connect(g_mqttClientId.c_str());

  if (ok)
  {
    serialLog.println("[MQTT] Conectat!");
    mqttClient.subscribe(TOPIC_RELAY_CMD);
    g_mqttConnected      = true;
    g_discoveryPublished = false;   // re-publica discovery dupa reconectare
  }
  else
  {
    serialLog.printf("[MQTT] Esuat (rc=%d) broker=%s:%d\n", mqttClient.state(), g_mqttBroker.c_str(), g_mqttPort);
    g_mqttConnected = false;
  }
  return ok;
}

void handleMqtt()
{
  if (!wifiManager.isConnected()) return;

  if (!mqttClient.connected())
  {
    static unsigned long lastAttempt = 0;
    if (millis() - lastAttempt >= 5000)
    {
      lastAttempt = millis();
      g_mqttConnected = false;
      mqttReconnect();
    }
    return;
  }

  mqttClient.loop();

  if (!g_discoveryPublished)
    publishDiscovery();
}

void publishState()
{
  if (!mqttClient.connected()) return;

  float temp, hum;
  bool  motion, relay;

  xSemaphoreTake(g_mutex, portMAX_DELAY);
  temp   = g_temperature;
  hum    = g_humidity;
  motion = g_motionDetected;
  relay  = g_relayActive;
  xSemaphoreGive(g_mutex);

  String json = "{";
  json += "\"temperature\":";
  json += isnan(temp) ? "null" : String(temp, 1);
  json += ",\"humidity\":";
  json += isnan(hum)  ? "null" : String(hum, 1);
  json += ",\"motion\":";
  json += motion ? "true" : "false";
  json += ",\"relay\":";
  json += relay  ? "true" : "false";
  json += ",\"uptime\":";
  json += String(millis() / 1000);
  json += "}";

  mqttClient.publish(TOPIC_STATE, json.c_str());
  mqttClient.publish(TOPIC_RELAY_STATE, relay ? "ON" : "OFF", true);
}

