SimedruF/ESP32-MQTT-Home-Assistant-DIY-Kit/src/main.cpp
// ============================================================
//  Web Server Handlers
// ============================================================
void handleRoot(WebServer& server)
{
  server.send_P(200, "text/html", htmlPage);
}

void handleUiConfigGet(WebServer& server)
{
  server.sendHeader("Cache-Control", "no-store");
  server.send(200, "application/json",
              String(F("{\"language\":\"")) + g_uiLanguage + F("\"}"));
}

void handleUiConfigPost(WebServer& server)
{
  const String language = server.arg("language");
  if (language != "ro" && language != "en")
  {
    server.send(400, "application/json",
                "{\"ok\":false,\"error\":\"language must be ro or en\"}");
    return;
  }
  if (!saveUiLanguage(language))
  {
    server.send(500, "application/json",
                "{\"ok\":false,\"error\":\"failed to save language\"}");
    return;
  }
  server.send(200, "application/json",
              String(F("{\"ok\":true,\"language\":\"")) + g_uiLanguage + F("\"}"));
}

void handleCommunicationConfigGet(WebServer& server)
{
  const bool zigbeeCapable = hasZigbeeCapability();
  const bool threadCapable = hasNativeIeee802154();
  const char* activeMode = activeCommunicationMode();

  String json;
  json.reserve(240);
  json = F("{\"visible\":");
  json += zigbeeCapable ? F("true") : F("false");
  json += F(",\"zigbee_capable\":");
  json += zigbeeCapable ? F("true") : F("false");
  json += F(",\"thread_capable\":");
  json += threadCapable ? F("true") : F("false");
  json += F(",\"selected_protocol\":\"");
  json += g_selectedCommunication;
  json += F("\",\"active_protocol\":\"");
  json += activeMode;
  json += F("\",\"zigbee_coordinator\":\"");
  json += g_zigbeeCoordinator;
  json += F("\",\"zigbee_coordinator_host\":\"");
  json += g_zigbeeCoordinatorHost;
  json += F("\",\"zigbee_pairing_mode\":\"");
  json += g_zigbeePairingMode;
  json += F("\",\"zbbridge_custom_device_supported\":false");
  json += F(",\"firmware_change_required\":");
  json += g_selectedCommunication == activeMode ? F("false") : F("true");
  json += '}';

  server.sendHeader("Cache-Control", "no-store");
  server.send(200, "application/json", json);
}

void handleCommunicationConfigPost(WebServer& server)
{
  if (!hasZigbeeCapability())
  {
    server.send(404, "application/json",
                "{\"ok\":false,\"error\":\"configuratia radio nu este disponibila pentru aceasta placa\"}");
    return;
  }

  const String mode = server.arg("protocol");
  const String coordinator = server.hasArg("zigbee_coordinator")
    ? server.arg("zigbee_coordinator")
    : g_zigbeeCoordinator;
  String coordinatorHost = server.hasArg("zigbee_coordinator_host")
    ? server.arg("zigbee_coordinator_host")
    : g_zigbeeCoordinatorHost;
  const String pairingMode = server.hasArg("zigbee_pairing_mode")
    ? server.arg("zigbee_pairing_mode")
    : g_zigbeePairingMode;
  coordinatorHost.trim();

  if (!isValidCommunicationMode(mode) ||
      !isValidZigbeeCoordinator(coordinator) ||
      !isValidCoordinatorHost(coordinatorHost) ||
      !isValidZigbeePairingMode(pairingMode))
  {
    server.send(400, "application/json",
                "{\"ok\":false,\"error\":\"configuratie Zigbee invalida sau indisponibila\"}");
    return;
  }

  if (!saveCommunicationConfig(mode, coordinator, coordinatorHost, pairingMode))
  {
    server.send(500, "application/json",
                "{\"ok\":false,\"error\":\"salvarea configuratiei in NVS a esuat\"}");
    return;
  }

  const bool firmwareChangeRequired = mode != activeCommunicationMode();
  String json = F("{\"ok\":true,\"selected_protocol\":\"");
  json += g_selectedCommunication;
  json += F("\",\"active_protocol\":\"");
  json += activeCommunicationMode();
  json += F("\",\"zigbee_coordinator\":\"");
  json += g_zigbeeCoordinator;
  json += F("\",\"zigbee_coordinator_host\":\"");
  json += g_zigbeeCoordinatorHost;
  json += F("\",\"zigbee_pairing_mode\":\"");
  json += g_zigbeePairingMode;
  json += F("\",\"firmware_change_required\":");
  json += firmwareChangeRequired ? F("true") : F("false");
  json += '}';
  serialLog.printf("[IoT] Configuratie salvata: %s, coordinator %s%s%s, pairing %s%s\n",
                   g_selectedCommunication.c_str(),
                   g_zigbeeCoordinator.c_str(),
                   g_zigbeeCoordinatorHost.length() ? " @ " : "",
                   g_zigbeeCoordinatorHost.c_str(),
                   g_zigbeePairingMode.c_str(),
                   firmwareChangeRequired ? " (necesita firmware compatibil)" : "");
  server.send(200, "application/json", json);
}

void handleData(WebServer& server)
{
  float temp, hum;
  bool  dhtPresent, motion, relay;

  xSemaphoreTake(g_mutex, portMAX_DELAY);
  temp       = g_temperature;
  hum        = g_humidity;
  dhtPresent = g_dhtPresent;
  motion     = g_motionDetected;
  relay      = g_relayActive;
  xSemaphoreGive(g_mutex);

  String json = "{";
  json += "\"dht_available\":";
  json += dhtPresent ? "true" : "false";
  json += ",\"pir_available\":";
  json += g_hardware.pirPin != PIN_DISABLED ? "true" : "false";
  json += ",\"relay_available\":";
  json += g_hardware.relayPin != PIN_DISABLED ? "true" : "false";
  json += ",\"oled_available\":";
  json += g_oledReady ? "true" : "false";
  json += ",\"heartbeat_available\":";
  json += g_hardware.heartbeatPin != PIN_DISABLED ? "true" : "false";
  json += ",\"temperature\":";
  json += isnan(temp) ? "null" : String(temp, 1);
  json += ",\"humidity\":";
  json += isnan(hum)  ? "null" : String(hum, 1);
  json += ",\"motion\":";
  json += motion ? "true" : "false";
  json += ",\"relay\":";
  json += relay  ? "true" : "false";
  json += ",\"mqtt_connected\":";
  json += g_mqttConnected ? "true" : "false";
  json += ",\"uptime_ms\":";
  json += String(millis());
  json += "}";

  server.send(200, "application/json", json);
}

void handleSerialLog(WebServer& server)
{
  uint32_t requestedSequence = 0;
  if (server.hasArg("since"))
    requestedSequence = static_cast<uint32_t>(strtoul(server.arg("since").c_str(), nullptr, 10));

  uint32_t firstSequence;
  uint32_t nextSequence;
  bool dataWasDropped;
  String logData = serialLog.readSince(requestedSequence, firstSequence,
                                       nextSequence, dataWasDropped);

  server.sendHeader("Cache-Control", "no-store");
  server.sendHeader("X-Log-Start", String(firstSequence));
  server.sendHeader("X-Log-Next", String(nextSequence));
  server.sendHeader("X-Log-Dropped", dataWasDropped ? "1" : "0");
  server.send(200, "text/plain; charset=utf-8", logData);
}

void handleSerialLogClear(WebServer& server)
{
  serialLog.clear();
  server.sendHeader("Cache-Control", "no-store");
  server.send(200, "application/json", "{\"ok\":true}");
}

