SimedruF/ESP32-MQTT-Home-Assistant-DIY-Kit/src/main.cpp
void handleApiRelay(WebServer& server)
{
  if (g_hardware.relayPin == PIN_DISABLED)
  {
    server.send(409, "application/json", "{\"error\":\"releul nu este configurat\"}");
    return;
  }

  if (!server.hasArg("state"))
  {
    server.send(400, "application/json", "{\"error\":\"missing state argument\"}");
    return;
  }
  String s       = server.arg("state");
  bool   newState = (s == "1" || s == "ON" || s == "on");
  setRelay(newState);
  server.send(200, "application/json", "{\"ok\":true}");
}

void handleApiRgbLedGet(WebServer& server)
{
  server.sendHeader("Cache-Control", "no-store");
  server.send(200, "application/json", rgbLedStateJson());
}

void handleApiRgbLedPost(WebServer& server)
{
  if (!RGB_LED_SUPPORTED)
  {
    server.send(409, "application/json",
                "{\"ok\":false,\"error\":\"placa nu expune un LED RGB onboard\"}");
    return;
  }

  if (server.hasArg("red") && server.hasArg("green") && server.hasArg("blue"))
  {
    const long red = server.arg("red").toInt();
    const long green = server.arg("green").toInt();
    const long blue = server.arg("blue").toInt();
    if (red < 0 || red > 255 || green < 0 || green > 255 || blue < 0 || blue > 255)
    {
      server.send(400, "application/json",
                  "{\"ok\":false,\"error\":\"valorile RGB trebuie sa fie intre 0 si 255\"}");
      return;
    }
    g_rgbLedRed = static_cast<uint8_t>(red);
    g_rgbLedGreen = static_cast<uint8_t>(green);
    g_rgbLedBlue = static_cast<uint8_t>(blue);
  }

  if (server.hasArg("brightness"))
  {
    const long brightness = server.arg("brightness").toInt();
    if (brightness < 0 || brightness > 100)
    {
      server.send(400, "application/json",
                  "{\"ok\":false,\"error\":\"luminozitatea trebuie sa fie intre 0 si 100\"}");
      return;
    }
    g_rgbLedBrightness = static_cast<uint8_t>(brightness);
  }

  if (server.hasArg("state"))
  {
    const String state = server.arg("state");
    g_rgbLedOn = state == "1" || state == "ON" || state == "on" || state == "true";
  }

  applyRgbLed();
  serialLog.printf("[RGB] %s #%02X%02X%02X, luminozitate %u%%\n",
                   g_rgbLedOn ? "ON" : "OFF",
                   g_rgbLedRed, g_rgbLedGreen, g_rgbLedBlue, g_rgbLedBrightness);

  String json = F("{\"ok\":true,\"led\":");
  json += rgbLedStateJson();
  json += '}';
  server.send(200, "application/json", json);
}

// GET /api/mqtt_config  → returneaza configuratia curenta (fara parola)
void handleMqttConfigGet(WebServer& server)
{
  String json = "{";
  json += "\"broker\":\"" + g_mqttBroker + "\",";
  json += "\"port\":"      + String(g_mqttPort) + ",";
  json += "\"user\":\""   + g_mqttUser + "\",";
  json += "\"client_id\":\"" + g_mqttClientId + "\",";
  json += "\"connected\":" + String(g_mqttConnected ? "true" : "false");
  json += "}";
  server.send(200, "application/json", json);
}

// POST /api/mqtt_config  → salveaza configuratia si reconnecteaza
void handleMqttConfigPost(WebServer& server)
{
  if (!server.hasArg("broker") || server.arg("broker").length() == 0)
  {
    server.send(400, "application/json", "{\"error\":\"broker obligatoriu\"}");
    return;
  }

  String broker   = server.arg("broker");
  int    port     = server.hasArg("port") ? server.arg("port").toInt() : 1883;
  String user     = server.hasArg("user")      ? server.arg("user")      : "";
  String pass     = server.hasArg("pass")      ? server.arg("pass")      : "";
  String clientId = server.hasArg("client_id") ? server.arg("client_id") : "esp32-ha-kit";

  // Validare port
  if (port <= 0 || port > 65535) port = 1883;

  saveMqttConfig(broker, port, user, pass, clientId);

  // Deconecteaza clientul MQTT pentru a forta reconectare cu noile setari
  if (mqttClient.connected()) mqttClient.disconnect();
  g_mqttConnected      = false;
  g_discoveryPublished = false;

  server.send(200, "application/json", "{\"ok\":true,\"message\":\"Salvat! ESP32 se reconecteaza la broker.\"}");
}

void handleApiStatus(WebServer& server)
{
  float temp, hum;
  bool  motion, relay;

  xSemaphoreTake(g_mutex, portMAX_DELAY);
  temp   = g_temperature;
  hum    = g_humidity;
  motion = g_motionDetected;
  relay  = g_relayActive;
  xSemaphoreGive(g_mutex);

  String json = "{";
  json += "\"device\":\"esp32-ha-kit\",";
  json += "\"ip\":\"" + wifiManager.getIPAddress() + "\",";
  json += "\"temperature\":";
  json += isnan(temp) ? "null" : String(temp, 1);
  json += ",\"humidity\":";
  json += isnan(hum)  ? "null" : String(hum, 1);
  json += ",\"motion\":";
  json += motion ? "true" : "false";
  json += ",\"relay\":";
  json += relay  ? "true" : "false";
  json += ",\"mqtt_connected\":";
  json += g_mqttConnected ? "true" : "false";
  json += ",\"uptime_ms\":";
  json += String(millis());
  json += "}";

  server.send(200, "application/json", json);
}

void handleBoardInfo(WebServer& server)
{
  esp_chip_info_t chip_info;
  esp_chip_info(&chip_info);

#if defined(SOC_WIFI_SUPPORTED) && SOC_WIFI_SUPPORTED
  const bool wifiCapable = true;
#else
  const bool wifiCapable = false;
#endif

  const bool ieee802154Capable = hasNativeIeee802154();
  const bool externalZigbeeCapable = hasExternalZigbeeRadio();

#if defined(ZIGBEE_COPROCESSOR_TLSR8258)
  const char* zigbeeFirmwareMode = "TLSR8258 extern; interfata HCI inactiva";
#elif defined(ZIGBEE_MODE_ED)
  const char* zigbeeFirmwareMode = "End Device";
#elif defined(ZIGBEE_MODE_ZCZR)
  const char* zigbeeFirmwareMode = "Coordinator / Router";
#else
  const char* zigbeeFirmwareMode = "Inactiv in firmware-ul curent";
#endif

  // Use WiFi MAC (already available, no extra header needed)
  String macStr = WiFi.macAddress();

  String resetReason;
  switch (esp_reset_reason()) {
    case ESP_RST_POWERON:  resetReason = "Power On";          break;
    case ESP_RST_EXT:      resetReason = "External Pin";      break;
    case ESP_RST_SW:       resetReason = "Software Reset";    break;
    case ESP_RST_PANIC:    resetReason = "Exception/Panic";   break;
    case ESP_RST_INT_WDT:  resetReason = "Interrupt Watchdog"; break;
    case ESP_RST_TASK_WDT: resetReason = "Task Watchdog";     break;
    case ESP_RST_DEEPSLEEP: resetReason = "Deep Sleep";       break;
    case ESP_RST_BROWNOUT: resetReason = "Brownout";          break;
    default:               resetReason = "Other";             break;
  }

  String json = "{";
  json += "\"chip_model\":\"" + String(ESP.getChipModel()) + "\",";
  json += "\"build_profile\":\"" + String(buildProfileName()) + "\",";
  json += "\"chip_revision\":" + String(chip_info.revision) + ",";
  json += "\"cpu_cores\":" + String(chip_info.cores) + ",";
  json += "\"cpu_freq\":" + String(ESP.getCpuFreqMHz()) + ",";
  json += "\"wifi_capable\":";
  json += wifiCapable ? "true" : "false";
  json += ",\"ieee802154_capable\":";
  json += ieee802154Capable ? "true" : "false";
  json += ",\"zigbee_external\":";
  json += externalZigbeeCapable ? "true" : "false";
  json += ",\"zigbee_capable\":";
  json += (ieee802154Capable || externalZigbeeCapable) ? "true" : "false";
  json += ",\"zigbee_firmware_mode\":\"" + String(zigbeeFirmwareMode) + "\",";
  json += "\"communication_selected\":\"" + g_selectedCommunication + "\",";
  json += "\"communication_active\":\"" + String(activeCommunicationMode()) + "\",";
  json += "\"thread_capable\":";
  json += ieee802154Capable ? "true" : "false";
  json += ",\"matter_capable\":";
  json += (wifiCapable || ieee802154Capable) ? "true" : "false";
  json += ",\"matter_wifi_capable\":";
  json += wifiCapable ? "true" : "false";
  json += ",\"matter_thread_capable\":";
  json += ieee802154Capable ? "true" : "false";
  json += ",";
  json += "\"flash_size\":" + String(ESP.getFlashChipSize()) + ",";
  json += "\"psram_size\":" + String(ESP.getPsramSize()) + ",";
  json += "\"free_heap\":" + String(ESP.getFreeHeap()) + ",";
  json += "\"min_free_heap\":" + String(ESP.getMinFreeHeap()) + ",";
  json += "\"sdk_version\":\"" + String(ESP.getSdkVersion()) + "\",";
  json += "\"mac_address\":\"" + macStr + "\",";
  json += "\"uptime_ms\":" + String(millis()) + ",";
  json += "\"reset_reason\":\"" + resetReason + "\",";
  json += "\"sketch_size\":" + String(ESP.getSketchSize()) + ",";
  json += "\"free_sketch_space\":" + String(ESP.getFreeSketchSpace()) + ",";
  json += "\"sketch_md5\":\"" + String(ESP.getSketchMD5()) + "\"";
  json += "}";

  server.send(200, "application/json", json);
}

int parsePinArgument(WebServer& server, const char* name, bool& ok)
{
  if (!server.hasArg(name))
  {
    ok = false;
    return PIN_DISABLED;
  }

  String value = server.arg(name);
  value.trim();
  if (value == "-1")
  {
    ok = true;
    return PIN_DISABLED;
  }

  if (value.length() == 0)
  {
    ok = false;
    return PIN_DISABLED;
  }

