SimedruF/ESP32-MQTT-Home-Assistant-DIY-Kit/src/main.cpp
  // Pastreaza dashboard-ul accesibil chiar daca DHCP schimba adresa IP.
  g_mdnsReady = MDNS.begin("esp32-ha-kit");
  if (g_mdnsReady)
  {
    MDNS.addService("http", "tcp", 80);
    serialLog.println("[mDNS] http://esp32-ha-kit.local");
  }
  else
  {
    serialLog.println("[mDNS] Initializarea a esuat; foloseste adresa IP");
  }

  // Rute web
  wifiManager.on("/",                    HTTP_GET,  handleRoot);
  wifiManager.on("/api/ui_config",       HTTP_GET,  handleUiConfigGet);
  wifiManager.on("/api/ui_config",       HTTP_POST, handleUiConfigPost);
  wifiManager.on("/api/communication_config", HTTP_GET,  handleCommunicationConfigGet);
  wifiManager.on("/api/communication_config", HTTP_POST, handleCommunicationConfigPost);
  wifiManager.on("/data",                HTTP_GET,  handleData);
  wifiManager.on("/api/status",          HTTP_GET,  handleApiStatus);
  wifiManager.on("/api/relay",           HTTP_GET,  handleApiRelay);
  wifiManager.on("/api/rgb_led",         HTTP_GET,  handleApiRgbLedGet);
  wifiManager.on("/api/rgb_led",         HTTP_POST, handleApiRgbLedPost);
  wifiManager.on("/api/serial_log",      HTTP_GET,  handleSerialLog);
  wifiManager.on("/api/serial_log/clear",HTTP_POST, handleSerialLogClear);
  wifiManager.on("/api/board_info",      HTTP_GET,  handleBoardInfo);
  wifiManager.on("/api/mqtt_config",     HTTP_GET,  handleMqttConfigGet);
  wifiManager.on("/api/mqtt_config",     HTTP_POST, handleMqttConfigPost);
  wifiManager.on("/api/hardware_config", HTTP_GET,  handleHardwareConfigGet);
  wifiManager.on("/api/hardware_config", HTTP_POST, handleHardwareConfigPost);
  wifiManager.on("/api/hardware_reset",  HTTP_POST, handleHardwareConfigReset);

  // Incarca si aplica configuratia MQTT din NVS
  loadMqttConfig();
  mqttClient.setServer(g_mqttBroker.c_str(), g_mqttPort);
  mqttClient.setCallback(mqttCallback);
  mqttClient.setBufferSize(512);

  // xTaskCreate este portabil pe tintele single-core si dual-core.
  xTaskCreate(taskSensors, "taskSensors", 4096, nullptr, 2, nullptr);
  if (g_hardware.heartbeatPin != PIN_DISABLED)
    xTaskCreate(taskHeartbeat, "taskHeartbeat", 1024, nullptr, 1, nullptr);

  serialLog.println("[WiFi] AP: ESP32_HAKit  /  Parola: 12345678");
  serialLog.println("[Web]  http://" + wifiManager.getIPAddress());
  if (g_mdnsReady)
    serialLog.println("[Web]  http://esp32-ha-kit.local");
  serialLog.println("[MQTT] Broker: " + g_mqttBroker + ":" + String(g_mqttPort));
  serialLog.printf("[Pini] DHT=%d PIR=%d Releu=%d LED=%d SDA=%d SCL=%d\n",
                   g_hardware.dhtPin, g_hardware.pirPin, g_hardware.relayPin,
                   g_hardware.heartbeatPin, g_hardware.sdaPin, g_hardware.sclPin);
  serialLog.println("=========================================\n");
}

void loop()
{
  wifiManager.handleClient();
  handleMqtt();

  if (g_restartAt != 0 && static_cast<long>(millis() - g_restartAt) >= 0)
  {
    ESP.restart();
  }

  // Detectie schimbare stare PIR → publish imediat
  static bool lastMotion = false;
  bool currentMotion;
  xSemaphoreTake(g_mutex, portMAX_DELAY);
  currentMotion = g_motionDetected;
  xSemaphoreGive(g_mutex);

  if (currentMotion != lastMotion)
  {
    lastMotion = currentMotion;
    publishState();
  }

  // OLED: actualizare la 500 ms (Wire doar din loop - core 1)
  static unsigned long lastOled = 0;
  if (millis() - lastOled >= 500)
  {
    lastOled = millis();
    if (g_oledReady) oledDrawStatus();
  }

  // Publish MQTT periodic la 30 secunde
  static unsigned long lastPublish = 0;
  if (millis() - lastPublish >= 30000)
  {
    lastPublish = millis();
    publishState();
  }

  // Log serial la 5 secunde
  static unsigned long lastLog = 0;
  if (millis() - lastLog >= 5000)
  {
    lastLog = millis();

    float temp, hum;
    bool  motion, relay;
    xSemaphoreTake(g_mutex, portMAX_DELAY);
    temp   = g_temperature;
    hum    = g_humidity;
    motion = g_motionDetected;
    relay  = g_relayActive;
    xSemaphoreGive(g_mutex);

    serialLog.println("--- Status ---");
    if (!isnan(temp))
      serialLog.printf("  Temperatura: %.1f C  Umiditate: %.1f%%\n", temp, hum);
    else
      serialLog.println("  DHT11: dezactivat sau citire invalida");
    serialLog.printf("  Miscare PIR: %s | Releu: %s\n",
                     motion ? "DETECTATA" : "Nu",
                     relay  ? "ON" : "OFF");
    serialLog.printf("  WiFi: %s | MQTT: %s\n",
                     wifiManager.isConnected()
                       ? ("STA " + wifiManager.getIPAddress()).c_str()
                       : "AP mode",
                     g_mqttConnected ? "Conectat" : "Deconectat");
  }
}
